soburi/JN516x-arduino-package/hardware/arduino/jen/boards.txt

twelite.name=TOCOS TWE-Lite

twelite.upload.tool=avrdude
twelite.upload.protocol=avr109
twelite.upload.maximum_size=196608
twelite.upload.maximum_data_size=2560
twelite.upload.speed=115200
twelite.upload.disable_flushing=true
twelite.upload.use_1200bps_touch=true
twelite.upload.wait_for_upload_port=false

twelite.build.mcu=JN5164
twelite.build.jennic_mcu_family=JN516x
twelite.build.board=TWE_LITE
# use clock frequency.
twelite.build.f_cpu=16000000L
twelite.build.usb_product="TWE-Lite-R"
twelite.build.core=arduino
twelite.build.ldscript=
twelite.build.variant=twelite
twelite.build.variant_system_include=
